# gadgets කියන්නෙ පිල්ලම් වලට

gadgets = dict([
    (0, '\u0DCA'), #No dependent vowels ක්
    (1,''), # අ
    (2,'\u0DCF'), # ආ
    (3,'\u0DD0'), # ඇ
    (4,'\u0DD1'), # ඈ
    (5,'\u0DD2'), # ඉ
    (6, '\u0DD3'), # ඊ
    (7, '\u0DD4'), # උ
    (8, '\u0DD6'), # ඌ
    (9, '\u0DD9'), # එ
    (10, '\u0DDA'), # ඒ
    (11, '\u0DDB'), # ඓ
    (12, '\u0DDC'), # ඔ
    (13, '\u0DDD'), # ඕ
])

vowels = dict([
    (1, '\u0D85'), # අ
    (2,'\u0D86'), # ආ
    (3,'\u0D87'), # ඇ
    (4,'\u0D88'), # ඈ
    (5,'\u0D89'), # ඉ
    (6,'\u0D8A'), # ඊ
    (7,'\u0D8B'), # උ
    (8,'\u0D8C'), # ඌ
    (9,'\u0D91'), # එ
    (10,'\u0D92'), # ඒ
    (11,'\u0D93'), # ඓ
    (12,'\u0D94'), # ඔ
    (13,'\u0D95'), # ඕ
    (14,'\u0D96'), # ඖ
    (15,'\u0D8D'), # ඍ
    (16,'\u0D8E'), # ඎ
    (17,'\u0D8F'), # ඏ
    (18,'\u0D90'), # ඐ
])

consanants = dict([
    (0, ['']),
    (20, ['\u0D9A', '\u0D9B']), # ක, ඛ
    (40, ['\u0D9C', '\u0D9D', '\u0D9F']), # ග, ඝ, ඟ
    (60, ['\u0D9E']), # ඞ
    (80, ['\u0DA0', '\u0DA1']), # ච, ඡ
    (100, ['\u0DA2']), # ජ
    (160, ['\u0DA7', '\u0DA8']), # ට, ඨ
    (180, ['\u0DAC']), # ඬ
    (200, ['\u0DAD', '\u0DAE']), # ත, ථ
    (220, ['\u0DAF', '\u0DB3', '\u0DB0']), # ද, ඳ, ධ
    (240, ['\u0DB1', '\u0DAB']), # න, ණ
    (260, ['\u0DB4', '\u0DB5']), # ප, ඵ
    (280, ['\u0DB6', '\u0DB9', '\u0DB7']), # බ, ඹ, භ 
    (300, ['\u0DB8']), # ම
    (320, ['\u0DBA']), # ය
    (340, ['\u0DBB']), # ර
    (360, ['\u0DBD', '\u0DC5']), # ල, ළ
    (380, ['\u0DC0']), # ව
    (400, ['\u0DC3']), # ස
    (420, ['\u0DC4']), # හ
    (440, ['\u0DC1', '\u0DC2']), # ශ, ෂ
    (460, ['\u0DC6']) # ෆ
])
